"""
Дан список чисел. Реализовать программу, которая
посчитает сумму всех чисел в списке, а также найдет
минимальный и максимальный элементы.
"""


numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(sum(numbers))
print(min(numbers))
print(max(numbers))
